In [5]:
import pandas as pd

In [6]:
s2= pd.Series([98,95,90,85,92],index=["DS","DAA","SE","DBMS","COA"])

In [7]:
import pandas as pd

data = [
    ["Alice", 25],
    ["Bob", 30],
    ["Charlie", 35]
]

df = pd.DataFrame(data, columns=["Name", "Age"])
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [8]:
import numpy as np

In [9]:
arr = np.array([[10,20],[30,40]])
pd.DataFrame(arr,columns =["A","B"])

    A   B
0  10  20
1  30  40

In [10]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [11]:
pd.read_excel("data1.xlsx")

    Name Clg  Marks
0  Krish   A     95
1   Heet   B     95
2  Rahul   M     95
3  Urval   D     95

In [12]:
df=pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [13]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [20]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [15]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [18]:
d1=df.copy()
d1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [25]:
minmax_col=['total_bill','tip','size']
for col in minmax_col:
    d1[col]=(d1[col]-d1[col].min())/(df[col].max()-df[col].min())
print(d1)

     total_bill       tip     sex smoker   day    time  size
0      0.000003  0.000002  Female     No   Sun  Dinner   0.2
1      0.000001  0.000101    Male     No   Sun  Dinner   0.4
2      0.000003  0.000381    Male     No   Sun  Dinner   0.4
3      0.000004  0.000352    Male     No   Sun  Dinner   0.2
4      0.000004  0.000398  Female     No   Sun  Dinner   0.6
..          ...       ...     ...    ...   ...     ...   ...
239    0.000005  0.000750    Male     No   Sat  Dinner   0.4
240    0.000005  0.000152  Female    Yes   Sat  Dinner   0.2
241    0.000004  0.000152    Male    Yes   Sat  Dinner   0.2
242    0.000003  0.000114    Male     No   Sat  Dinner   0.2
243    0.000003  0.000305  Female     No  Thur  Dinner   0.2

[244 rows x 7 columns]